[Killed] ArrowFunction
src/modules/Auth/Auth.tsx:21:25
 import { connect } from "react-redux";
 import { Redirect } from "react-router-dom";
 
-const mapStateToProps = (state: AppState) => ({
-  userName: state.auth.userName,
-  userGender: state.auth.userGender,
-  user: state.auth.user,
-});
+const mapStateToProps = () => undefined;
 const mapDispatchToProps = {
   setUserName,

[Killed] ObjectLiteral
src/modules/Auth/Auth.tsx:21:47
 import { connect } from "react-redux";
 import { Redirect } from "react-router-dom";
 
-const mapStateToProps = (state: AppState) => ({
-  userName: state.auth.userName,
-  userGender: state.auth.userGender,
-  user: state.auth.user,
-});
+const mapStateToProps = (state: AppState) => ({});
 const mapDispatchToProps = {
   setUserName,

[Killed] BlockStatement
src/modules/Auth/Auth.tsx:45:14
   getStoredUser,
 }) => {
   const onSubmit = useCallback(
-    (evt) => {
-      evt.preventDefault();
-      setUser({ name: userName, gender: userGender });
-    },
+    (evt) => {},
     [userName, userGender, setUser]
   );

[Killed] BlockStatement
src/modules/Auth/Auth.tsx:52:25
     [userName, userGender, setUser]
   );
   const onChangeName = useCallback(
-    (e: ChangeEvent) => {
-	  setUserName((e.target as any).value);
-    },
+    (e: ChangeEvent) => {},
     [setUserName]
   );

[Killed] BlockStatement
src/modules/Auth/Auth.tsx:58:25
     [setUserName]
   );
   const onChangeGender = useCallback(
-    (e: ChangeEvent) => {
-      setUserGender((e.target as any).value as Gender);
-    },
+    (e: ChangeEvent) => {},
     [setUserGender]
   );

[Killed] BlockStatement
src/modules/Auth/Auth.tsx:64:19
     [setUserGender]
   );
 
-  useEffect(() => {
-    getStoredUser();
-  }, [getStoredUser]);
+  useEffect(() => {}, [getStoredUser]);
 
   return user ? (

[Survived] ArrayDeclaration
src/modules/Auth/Auth.tsx:66:6
 
   useEffect(() => {
     getStoredUser();
-  }, [getStoredUser]);
+  }, []);
 
   return user ? (

[Survived] BooleanLiteral
src/modules/Auth/Auth.tsx:69:32
   }, [getStoredUser]);
 
   return user ? (
-    <Redirect to="/game" push={true} />
+    <Redirect to="/game" push={false} />
   ) : (
     <FormStyled name="authForm" onSubmit={onSubmit}>

[Killed] ConditionalExpression
src/modules/Auth/Auth.tsx:84:20
       <GenderContainer>
         <input
           type="radio"
-          checked={userGender === "male"}
+          checked={true}
           value="male"
           name="gender"

[Killed] EqualityOperator
src/modules/Auth/Auth.tsx:84:31
       <GenderContainer>
         <input
           type="radio"
-          checked={userGender === "male"}
+          checked={userGender !== "male"}
           value="male"
           name="gender"

[Killed] EqualityOperator
src/modules/Auth/Auth.tsx:92:31
         М
         <input
           type="radio"
-          checked={userGender === "female"}
+          checked={userGender !== "female"}
           value="female"
           name="gender"

[Killed] ConditionalExpression
src/modules/Auth/Auth.tsx:92:20
         М
         <input
           type="radio"
-          checked={userGender === "female"}
+          checked={true}
           value="female"
           name="gender"

[Killed] ConditionalExpression
src/modules/Auth/Auth.tsx:100:20
         Ж
         <input
           type="radio"
-          checked={userGender === "robot"}
+          checked={false}
           value="robot"
           name="gender"

[Killed] EqualityOperator
src/modules/Auth/Auth.tsx:100:31
         Ж
         <input
           type="radio"
-          checked={userGender === "robot"}
+          checked={userGender !== "robot"}
           value="robot"
           name="gender"
