[Survived] ArrowFunction
Otus_react/otus_react_game_of_life/src/App.tsx:7:24
 import { BrowserRouter, Route } from "react-router-dom";
 import { AuthScreen, GameScreen } from "./screens";
 
-export const App: FC = () => (
-  <Provider store={store}>
-    <BrowserRouter>
-      <Route path="/" exact>
-        <AuthScreen />
-      </Route>
-      <Route path="/game">
-        <GameScreen />
-      </Route>
-    </BrowserRouter>
-  </Provider>
-);
+export const App: FC = () => undefined;
 
