[Killed] StringLiteral
src/modules/Auth/authReducer.ts:11:12
 }
 
 export const initAuthState: AuthState = {
-	userName: "",
+	userName: "Stryker was here!",
 	userGender: "robot",
 	user: null,

[Killed] ObjectLiteral
src/modules/Auth/authReducer.ts:19:12
 const authSlice = createSlice({
 	name: "auth",
 	initialState: initAuthState,
-	reducers: {
-		setUserName(state, action) {
-			state.userName = action.payload;
-		},
-		setUserGender(state, action) {
-			state.userGender = action.payload;
-		},
-		setUser(state, action) {
-			if (action.payload) {
-				const { name, gender } = action.payload;
-
-				if (name && gender) {
-					state.user = { name, gender };
-				}
-			}
-		},
-		getStoredUser(_) { },
-		logout(state) {
-			state.userName = "";
-			state.userGender = "robot";
-			state.user = null;
-		 },
-	}
+	reducers: {}
 });
 

[Killed] BlockStatement
src/modules/Auth/authReducer.ts:20:30
 	name: "auth",
 	initialState: initAuthState,
 	reducers: {
-		setUserName(state, action) {
-			state.userName = action.payload;
-		},
+		setUserName(state, action) {},
 		setUserGender(state, action) {
 			state.userGender = action.payload;

[Killed] BlockStatement
src/modules/Auth/authReducer.ts:23:32
 		setUserName(state, action) {
 			state.userName = action.payload;
 		},
-		setUserGender(state, action) {
-			state.userGender = action.payload;
-		},
+		setUserGender(state, action) {},
 		setUser(state, action) {
 			if (action.payload) {

[Killed] BlockStatement
src/modules/Auth/authReducer.ts:26:26
 		setUserGender(state, action) {
 			state.userGender = action.payload;
 		},
-		setUser(state, action) {
-			if (action.payload) {
-				const { name, gender } = action.payload;
-
-				if (name && gender) {
-					state.user = { name, gender };
-				}
-			}
-		},
+		setUser(state, action) {},
 		getStoredUser(_) { },
 		logout(state) {

[Killed] ConditionalExpression
src/modules/Auth/authReducer.ts:27:8
 			state.userGender = action.payload;
 		},
 		setUser(state, action) {
-			if (action.payload) {
+			if (true) {
 				const { name, gender } = action.payload;
 

[Killed] BlockStatement
src/modules/Auth/authReducer.ts:27:24
 			state.userGender = action.payload;
 		},
 		setUser(state, action) {
-			if (action.payload) {
-				const { name, gender } = action.payload;
-
-				if (name && gender) {
-					state.user = { name, gender };
-				}
-			}
+			if (action.payload) {}
 		},
 		getStoredUser(_) { },

[Killed] ConditionalExpression
src/modules/Auth/authReducer.ts:30:9
 			if (action.payload) {
 				const { name, gender } = action.payload;
 
-				if (name && gender) {
+				if (true) {
 					state.user = { name, gender };
 				}

[Killed] LogicalOperator
src/modules/Auth/authReducer.ts:30:14
 			if (action.payload) {
 				const { name, gender } = action.payload;
 
-				if (name && gender) {
+				if (name || gender) {
 					state.user = { name, gender };
 				}

[Killed] ObjectLiteral
src/modules/Auth/authReducer.ts:31:19
 				const { name, gender } = action.payload;
 
 				if (name && gender) {
-					state.user = { name, gender };
+					state.user = {};
 				}
 			}

[Killed] BlockStatement
src/modules/Auth/authReducer.ts:36:17
 			}
 		},
 		getStoredUser(_) { },
-		logout(state) {
-			state.userName = "";
-			state.userGender = "robot";
-			state.user = null;
-		 },
+		logout(state) {},
 	}
 });

[Killed] StringLiteral
src/modules/Auth/authReducer.ts:37:21
 		},
 		getStoredUser(_) { },
 		logout(state) {
-			state.userName = "";
+			state.userName = "Stryker was here!";
 			state.userGender = "robot";
 			state.user = null;
