[Survived] StringLiteral
src/components/Cell/Cell.stories.tsx:8:10
 import { CellState } from ".";
 
 export default {
-  title: "Cell",
+  title: "",
   component: Cell,
   decorators: [withKnobs],

[Survived] BlockStatement
src/components/Cell/Cell.stories.tsx:13:36
   decorators: [withKnobs],
 };
 
-export const CellStory: FC = () => {
-  return (
-    <Cell
-      state={select("Cell state", CellState, CellState.alive)}
-      onCellClick={action("Click")}
-      height={number("Height", 20)}
-      width={number("Width", 20)}
-    />
-  );
-};
+export const CellStory: FC = () => {};
 

[Survived] StringLiteral
src/components/Cell/Cell.stories.tsx:18:22
     <Cell
       state={select("Cell state", CellState, CellState.alive)}
       onCellClick={action("Click")}
-      height={number("Height", 20)}
+      height={number("", 20)}
       width={number("Width", 20)}
     />
