[Killed] BlockStatement
src/modules/Auth/authSaga.ts:11:21
 import { default as spritesFemale } from "@dicebear/avatars-female-sprites";
 import { default as spritesBottts } from "@dicebear/avatars-bottts-sprites";
 
-function* getUser() {
-	const user = authService.getLoggedInUser();
-
-	if (user) {
-		yield put(setUserName(user.name));
-		yield put(setUserGender(user.gender));
-		yield put(setUser(user));
-	}
-}
+function* getUser() {}
 
 export function createAvatar(gender: any, name: string) {

[Killed] BlockStatement
src/modules/Auth/authSaga.ts:14:12
 function* getUser() {
 	const user = authService.getLoggedInUser();
 
-	if (user) {
-		yield put(setUserName(user.name));
-		yield put(setUserGender(user.gender));
-		yield put(setUser(user));
-	}
+	if (user) {}
 }
 

[Killed] BlockStatement
src/modules/Auth/authSaga.ts:21:57
 	}
 }
 
-export function createAvatar(gender: any, name: string) {
-	const spriteHandler: any = {
-		robot: spritesBottts,
-		male: spritesMale,
-		female: spritesFemale,
-	};
-
-	const sprite: SpriteCollection | undefined =
-		spriteHandler[gender] ?? undefined;
-
-	return sprite ? new Avatars(sprite, { base64: true }).create(name) : "";
-}
+export function createAvatar(gender: any, name: string) {}
 
 function* login({ payload }: ReturnType<typeof setUser>) {

[Survived] ObjectLiteral
src/modules/Auth/authSaga.ts:22:29
 }
 
 export function createAvatar(gender: any, name: string) {
-	const spriteHandler: any = {
-		robot: spritesBottts,
-		male: spritesMale,
-		female: spritesFemale,
-	};
+	const spriteHandler: any = {};
 
 	const sprite: SpriteCollection | undefined =

[Killed] ConditionalExpression
src/modules/Auth/authSaga.ts:29:3
 	};
 
 	const sprite: SpriteCollection | undefined =
-		spriteHandler[gender] ?? undefined;
+		true;
 
 	return sprite ? new Avatars(sprite, { base64: true }).create(name) : "";

[Survived] ConditionalExpression
src/modules/Auth/authSaga.ts:29:3
 	};
 
 	const sprite: SpriteCollection | undefined =
-		spriteHandler[gender] ?? undefined;
+		false;
 
 	return sprite ? new Avatars(sprite, { base64: true }).create(name) : "";

[Survived] BooleanLiteral
src/modules/Auth/authSaga.ts:31:48
 	const sprite: SpriteCollection | undefined =
 		spriteHandler[gender] ?? undefined;
 
-	return sprite ? new Avatars(sprite, { base64: true }).create(name) : "";
+	return sprite ? new Avatars(sprite, { base64: false }).create(name) : "";
 }
 

[Killed] BlockStatement
src/modules/Auth/authSaga.ts:34:58
 	return sprite ? new Avatars(sprite, { base64: true }).create(name) : "";
 }
 
-function* login({ payload }: ReturnType<typeof setUser>) {
-	const gender = payload?.gender;
-	const name = payload?.name;
-
-	const userPicSvg = name ? yield call(createAvatar, gender, name) : "";
-
-	yield put(setUserpic(userPicSvg));
-
-	authService.login(payload);
-}
+function* login({ payload }: ReturnType<typeof setUser>) {}
 
 function* doLogout() {

[Killed] BlockStatement
src/modules/Auth/authSaga.ts:45:22
 	authService.login(payload);
 }
 
-function* doLogout() {
-	authService.logout();
-}
+function* doLogout() {}
 
 export function* authSaga() {

[Killed] BlockStatement
src/modules/Auth/authSaga.ts:49:29
 	authService.logout();
 }
 
-export function* authSaga() {
-	yield takeEvery(getStoredUser.type, getUser);
-	yield takeEvery(setUser.type, login);
-	yield takeEvery(logout.type, doLogout);
-}
+export function* authSaga() {}
