[Killed] BlockStatement
src/components/Cell/Cell.styles.tsx:16:77
   opacity: 0.5;
 `;
 
-const getStyle: (cellState: CellState) => SerializedStyles = (cellState) => {
-  switch (cellState) {
-    case CellState.alive:
-      return aliveStyle;
-    case CellState.dead:
-      return deadStyle;
-    default:
-      throw TypeError("Unknown cell state");
-  }
-};
+const getStyle: (cellState: CellState) => SerializedStyles = (cellState) => {};
 
 export const CellStyled = styled.button<{

[Killed] ConditionalExpression
src/components/Cell/Cell.styles.tsx:18:5
 
 const getStyle: (cellState: CellState) => SerializedStyles = (cellState) => {
   switch (cellState) {
-    case CellState.alive:
-      return aliveStyle;
+    case CellState.alive:
     case CellState.dead:
       return deadStyle;

[Killed] ConditionalExpression
src/components/Cell/Cell.styles.tsx:20:5
   switch (cellState) {
     case CellState.alive:
       return aliveStyle;
-    case CellState.dead:
-      return deadStyle;
+    case CellState.dead:
     default:
       throw TypeError("Unknown cell state");

[Survived] ConditionalExpression
src/components/Cell/Cell.styles.tsx:22:5
       return aliveStyle;
     case CellState.dead:
       return deadStyle;
-    default:
-      throw TypeError("Unknown cell state");
+    default:
   }
 };

[Survived] ArrowFunction
src/components/Cell/Cell.styles.tsx:32:12
   width: number;
   height: number;
 }>`
-  width: ${(props) => props.width}px;
+  width: ${() => undefined}px;
   height: ${(props) => props.height}px;
   border: 1px solid;

[Survived] ArrowFunction
src/components/Cell/Cell.styles.tsx:33:13
   height: number;
 }>`
   width: ${(props) => props.width}px;
-  height: ${(props) => props.height}px;
+  height: ${() => undefined}px;
   border: 1px solid;
   display: inline-block;

[Killed] ArrowFunction
src/components/Cell/Cell.styles.tsx:42:5
   cursor: pointer;
   outline: none;
 
-  ${(props) => getStyle(props.cellState)};
+  ${() => undefined};
 `;
 
