[Survived] StringLiteral
src/modules/Auth/authService.ts:11:35
 
 class LocalStorageAuthService implements AuthService {
 	readonly userNameKey: string = "userName";
-	readonly userGenderKey: string = "userGender";
+	readonly userGenderKey: string = "";
 
 	getLoggedInUser() {

[Killed] BlockStatement
src/modules/Auth/authService.ts:13:20
 	readonly userNameKey: string = "userName";
 	readonly userGenderKey: string = "userGender";
 
-	getLoggedInUser() {
-		const name = localStorage.getItem(this.userNameKey) ?? "";
-		const gender =
-			(localStorage.getItem(this.userGenderKey) as Gender) ?? "robot";
-
-		if (name) {
-			return { name, gender } as User;
-		}
-
-		return void 0;
-	}
+	getLoggedInUser() {}
 
 	logout() {

[Killed] ConditionalExpression
src/modules/Auth/authService.ts:14:16
 	readonly userGenderKey: string = "userGender";
 
 	getLoggedInUser() {
-		const name = localStorage.getItem(this.userNameKey) ?? "";
+		const name = false;
 		const gender =
 			(localStorage.getItem(this.userGenderKey) as Gender) ?? "robot";

[Killed] ConditionalExpression
src/modules/Auth/authService.ts:14:16
 	readonly userGenderKey: string = "userGender";
 
 	getLoggedInUser() {
-		const name = localStorage.getItem(this.userNameKey) ?? "";
+		const name = true;
 		const gender =
 			(localStorage.getItem(this.userGenderKey) as Gender) ?? "robot";

[Killed] ConditionalExpression
src/modules/Auth/authService.ts:16:4
 	getLoggedInUser() {
 		const name = localStorage.getItem(this.userNameKey) ?? "";
 		const gender =
-			(localStorage.getItem(this.userGenderKey) as Gender) ?? "robot";
+			true;
 
 		if (name) {

[Killed] ConditionalExpression
src/modules/Auth/authService.ts:16:4
 	getLoggedInUser() {
 		const name = localStorage.getItem(this.userNameKey) ?? "";
 		const gender =
-			(localStorage.getItem(this.userGenderKey) as Gender) ?? "robot";
+			false;
 
 		if (name) {

[Killed] BlockStatement
src/modules/Auth/authService.ts:18:13
 		const gender =
 			(localStorage.getItem(this.userGenderKey) as Gender) ?? "robot";
 
-		if (name) {
-			return { name, gender } as User;
-		}
+		if (name) {}
 
 		return void 0;

[Killed] ObjectLiteral
src/modules/Auth/authService.ts:19:11
 			(localStorage.getItem(this.userGenderKey) as Gender) ?? "robot";
 
 		if (name) {
-			return { name, gender } as User;
+			return {} as User;
 		}
 

[Killed] BlockStatement
src/modules/Auth/authService.ts:25:11
 		return void 0;
 	}
 
-	logout() {
-		localStorage.removeItem(this.userNameKey);
-		localStorage.removeItem(this.userGenderKey);
-	}
+	logout() {}
 
 	login(user: User) {

[Killed] BlockStatement
src/modules/Auth/authService.ts:30:20
 		localStorage.removeItem(this.userGenderKey);
 	}
 
-	login(user: User) {
-		if (!user?.name || !user?.gender) {
-			return;
-		}
-
-		localStorage.setItem(this.userNameKey, user.name);
-		localStorage.setItem(this.userGenderKey, user.gender);
-	}
+	login(user: User) {}
 }
 

[Killed] BooleanLiteral
src/modules/Auth/authService.ts:31:7
 	}
 
 	login(user: User) {
-		if (!user?.name || !user?.gender) {
+		if (user?.name || !user?.gender) {
 			return;
 		}

[Killed] BooleanLiteral
src/modules/Auth/authService.ts:31:22
 	}
 
 	login(user: User) {
-		if (!user?.name || !user?.gender) {
+		if (!user?.name || user?.gender) {
 			return;
 		}
