[Survived] ObjectLiteral
src/components/ImageButton/ImageButton.stories.tsx:6:16
 import { ImageButton } from ".";
 import { withKnobs, select, boolean, text  } from "@storybook/addon-knobs";
 
-export default {
-  title: "Image button",
-  component: ImageButton,
-  decorators: [withKnobs],
-};
+export default {};
 
 export const ImageButtonStory: FC = () => {

[Survived] StringLiteral
src/components/ImageButton/ImageButton.stories.tsx:7:10
 import { withKnobs, select, boolean, text  } from "@storybook/addon-knobs";
 
 export default {
-  title: "Image button",
+  title: "",
   component: ImageButton,
   decorators: [withKnobs],

[Survived] ArrayDeclaration
src/components/ImageButton/ImageButton.stories.tsx:9:15
 export default {
   title: "Image button",
   component: ImageButton,
-  decorators: [withKnobs],
+  decorators: [],
 };
 

[Survived] BlockStatement
src/components/ImageButton/ImageButton.stories.tsx:12:43
   decorators: [withKnobs],
 };
 
-export const ImageButtonStory: FC = () => {
-
-  return (
-    <ImageButton
-      onClick={action("Click")}
-      type={select("Type", {submit:"submit", reset:"reset", button:"button"}, "submit")}
-	  title={text('Title', 'title')}
-	  disabled={boolean('Disabled', false)}
-    />
-  );
-};
+export const ImageButtonStory: FC = () => {};

[Survived] StringLiteral
src/components/ImageButton/ImageButton.stories.tsx:16:23
 
   return (
     <ImageButton
-      onClick={action("Click")}
+      onClick={action("")}
       type={select("Type", {submit:"submit", reset:"reset", button:"button"}, "submit")}
 	  title={text('Title', 'title')}

[Survived] StringLiteral
src/components/ImageButton/ImageButton.stories.tsx:17:36
   return (
     <ImageButton
       onClick={action("Click")}
-      type={select("Type", {submit:"submit", reset:"reset", button:"button"}, "submit")}
+      type={select("Type", {submit:"", reset:"reset", button:"button"}, "submit")}
 	  title={text('Title', 'title')}
 	  disabled={boolean('Disabled', false)}

[Survived] StringLiteral
src/components/ImageButton/ImageButton.stories.tsx:17:79
   return (
     <ImageButton
       onClick={action("Click")}
-      type={select("Type", {submit:"submit", reset:"reset", button:"button"}, "submit")}
+      type={select("Type", {submit:"submit", reset:"reset", button:"button"}, "")}
 	  title={text('Title', 'title')}
 	  disabled={boolean('Disabled', false)}

[Survived] StringLiteral
src/components/ImageButton/ImageButton.stories.tsx:18:16
     <ImageButton
       onClick={action("Click")}
       type={select("Type", {submit:"submit", reset:"reset", button:"button"}, "submit")}
-	  title={text('Title', 'title')}
+	  title={text("", 'title')}
 	  disabled={boolean('Disabled', false)}
     />

[Survived] StringLiteral
src/components/ImageButton/ImageButton.stories.tsx:18:25
     <ImageButton
       onClick={action("Click")}
       type={select("Type", {submit:"submit", reset:"reset", button:"button"}, "submit")}
-	  title={text('Title', 'title')}
+	  title={text('Title', "")}
 	  disabled={boolean('Disabled', false)}
     />

[Survived] BooleanLiteral
src/components/ImageButton/ImageButton.stories.tsx:19:34
       onClick={action("Click")}
       type={select("Type", {submit:"submit", reset:"reset", button:"button"}, "submit")}
 	  title={text('Title', 'title')}
-	  disabled={boolean('Disabled', false)}
+	  disabled={boolean('Disabled', true)}
     />
   );

[Survived] StringLiteral
src/components/ImageButton/ImageButton.stories.tsx:19:22
       onClick={action("Click")}
       type={select("Type", {submit:"submit", reset:"reset", button:"button"}, "submit")}
 	  title={text('Title', 'title')}
-	  disabled={boolean('Disabled', false)}
+	  disabled={boolean("", false)}
     />
   );
