[Survived] ArrowFunction
otus_react_game_of_life/src/screens/AuthScreen.tsx:4:27
 import React from "react";
 import { Auth } from "@/modules/Auth";
 
-export const AuthScreen = () => <Auth />;
+export const AuthScreen = () => undefined;
 
