[Killed] ArrowFunction
src/components/Cell/Cell.tsx:11:6
   width: number;
   onCellClick: () => void;
   name?: string;
-}> = ({ state, height, width, onCellClick, name }) => (
-  <CellStyled
-    name={name}
-    cellState={state}
-    height={height}
-    width={width}
-    onClick={onCellClick}
-  ></CellStyled>
-);
+}> = () => undefined;
 
