[Survived] ArrowFunction
src/components/ImageButton/ImageButton.styles.tsx:5:14
 
 export const ImageStyled = styled.img<{ disabled: boolean }>`
   height: 2rem;
-  opacity: ${(p) => (p.disabled ? 0.4 : 1)};
+  opacity: ${() => undefined};
 `;
 
