[Survived] ConditionalExpression
src/modules/Auth/Auth.tsx:100:20
         Ж
         <input
           type="radio"
-          checked={userGender === "robot"}
+          checked={true}
           value="robot"
           name="gender"
