[Killed] ArrowFunction
src/components/ImageButton/ImageButton.tsx:12:6
   disabled?: boolean;
   title?: string;
   name?: string;
-}> = ({ src, type, onClick, disabled, title, name }) => (
-  <ButtonStyled type={type} onClick={onClick} disabled={disabled} name={name}>
-    <ImageStyled
-      src={src || DefaultImg}
-      disabled={disabled || false}
-      title={title}
-    />
-  </ButtonStyled>
-);
+}> = () => undefined;
 

[Survived] LogicalOperator
src/components/ImageButton/ImageButton.tsx:15:16
 }> = ({ src, type, onClick, disabled, title, name }) => (
   <ButtonStyled type={type} onClick={onClick} disabled={disabled} name={name}>
     <ImageStyled
-      src={src || DefaultImg}
+      src={src && DefaultImg}
       disabled={disabled || false}
       title={title}

[Survived] ConditionalExpression
src/components/ImageButton/ImageButton.tsx:15:12
 }> = ({ src, type, onClick, disabled, title, name }) => (
   <ButtonStyled type={type} onClick={onClick} disabled={disabled} name={name}>
     <ImageStyled
-      src={src || DefaultImg}
+      src={false}
       disabled={disabled || false}
       title={title}

[Survived] BooleanLiteral
src/components/ImageButton/ImageButton.tsx:16:29
   <ButtonStyled type={type} onClick={onClick} disabled={disabled} name={name}>
     <ImageStyled
       src={src || DefaultImg}
-      disabled={disabled || false}
+      disabled={disabled || true}
       title={title}
     />

[Survived] ConditionalExpression
src/components/ImageButton/ImageButton.tsx:16:17
   <ButtonStyled type={type} onClick={onClick} disabled={disabled} name={name}>
     <ImageStyled
       src={src || DefaultImg}
-      disabled={disabled || false}
+      disabled={false}
       title={title}
     />
