[Survived] BlockStatement
src/components/SettingsPanel/SettingsPanel.stories.tsx:12:40
   decorators: [withKnobs],
 };
 
-export const SettingsStory: FC = () => {
-  return (
-    <SettingsPanel
-      setIsSettingsVisible={action("Set settings visibility")}
-      setSettings={action("Set settings")}
-      visible={boolean("Visible", true)}
-      settings={
-        {
-          height: number("Height", 300, undefined, "Settings"),
-          width: number("Width", 300, undefined, "Settings"),
-          rowCount: number("Row count", 10, undefined, "Settings"),
-          columnCount: number("Column count", 10, undefined, "Settings"),
-          fillingPercent: number("Percent", 50, undefined, "Settings"),
-          frequency: number("Frequency", 100, undefined, "Settings"),
-        } as GameSettings
-      }
-    />
-  );
-};
+export const SettingsStory: FC = () => {};
 

[Survived] StringLiteral
src/components/SettingsPanel/SettingsPanel.stories.tsx:15:36
 export const SettingsStory: FC = () => {
   return (
     <SettingsPanel
-      setIsSettingsVisible={action("Set settings visibility")}
+      setIsSettingsVisible={action("")}
       setSettings={action("Set settings")}
       visible={boolean("Visible", true)}

[Survived] StringLiteral
src/components/SettingsPanel/SettingsPanel.stories.tsx:16:27
   return (
     <SettingsPanel
       setIsSettingsVisible={action("Set settings visibility")}
-      setSettings={action("Set settings")}
+      setSettings={action("")}
       visible={boolean("Visible", true)}
       settings={

[Survived] BooleanLiteral
src/components/SettingsPanel/SettingsPanel.stories.tsx:17:35
     <SettingsPanel
       setIsSettingsVisible={action("Set settings visibility")}
       setSettings={action("Set settings")}
-      visible={boolean("Visible", true)}
+      visible={boolean("Visible", false)}
       settings={
         {

[Survived] StringLiteral
src/components/SettingsPanel/SettingsPanel.stories.tsx:17:24
     <SettingsPanel
       setIsSettingsVisible={action("Set settings visibility")}
       setSettings={action("Set settings")}
-      visible={boolean("Visible", true)}
+      visible={boolean("", true)}
       settings={
         {

[Survived] StringLiteral
src/components/SettingsPanel/SettingsPanel.stories.tsx:23:62
           height: number("Height", 300, undefined, "Settings"),
           width: number("Width", 300, undefined, "Settings"),
           rowCount: number("Row count", 10, undefined, "Settings"),
-          columnCount: number("Column count", 10, undefined, "Settings"),
+          columnCount: number("Column count", 10, undefined, ""),
           fillingPercent: number("Percent", 50, undefined, "Settings"),
           frequency: number("Frequency", 100, undefined, "Settings"),

[Survived] StringLiteral
src/components/SettingsPanel/SettingsPanel.stories.tsx:25:58
           rowCount: number("Row count", 10, undefined, "Settings"),
           columnCount: number("Column count", 10, undefined, "Settings"),
           fillingPercent: number("Percent", 50, undefined, "Settings"),
-          frequency: number("Frequency", 100, undefined, "Settings"),
+          frequency: number("Frequency", 100, undefined, ""),
         } as GameSettings
       }
