[Killed] ArrowFunction
src/components/SettingsPanel/Overlay.tsx:4:28
 import React, { FC } from "react";
 import { OverlayStyled, OverlayChildrenStyled } from "./SettingsPanel.styles";
 
-export const Overlay: FC = ({ children }) => (
-  <>
-    <OverlayStyled />
-    <OverlayChildrenStyled>{children}</OverlayChildrenStyled>
-  </>
-);
+export const Overlay: FC = () => undefined;
 
