[Killed] BlockStatement
src/components/SettingsPanel/SettingsPanel.tsx:24:56
   setSettings: (settings: GameSettings) => void;
   setIsSettingsVisible: (isVisible: boolean) => void;
 }> = ({ visible, settings, setSettings, setIsSettingsVisible }) => {
-  const onSubmitSettings = (settings: GameSettings) => {
-    setSettings(settings);
-    setIsSettingsVisible(false);
-  };
+  const onSubmitSettings = (settings: GameSettings) => {};
 
   if (!visible) {

[Killed] BooleanLiteral
src/components/SettingsPanel/SettingsPanel.tsx:26:26
 }> = ({ visible, settings, setSettings, setIsSettingsVisible }) => {
   const onSubmitSettings = (settings: GameSettings) => {
     setSettings(settings);
-    setIsSettingsVisible(false);
+    setIsSettingsVisible(true);
   };
 

[Killed] BooleanLiteral
src/components/SettingsPanel/SettingsPanel.tsx:29:7
     setIsSettingsVisible(false);
   };
 
-  if (!visible) {
+  if (visible) {
     return null;
   }

[Killed] ConditionalExpression
src/components/SettingsPanel/SettingsPanel.tsx:29:7
     setIsSettingsVisible(false);
   };
 
-  if (!visible) {
+  if (true) {
     return null;
   }

[Killed] BooleanLiteral
src/components/SettingsPanel/SettingsPanel.tsx:65:51
           <ButtonsContainer>
             <ImageButton
               type="button"
-              onClick={() => setIsSettingsVisible(false)}
+              onClick={() => setIsSettingsVisible(true)}
               key="closeBtn"
               src={CancelImg}

[Killed] ArrowFunction
src/components/SettingsPanel/SettingsPanel.tsx:65:24
           <ButtonsContainer>
             <ImageButton
               type="button"
-              onClick={() => setIsSettingsVisible(false)}
+              onClick={() => undefined}
               key="closeBtn"
               src={CancelImg}
