[Survived] ArrowFunction
otus_react_game_of_life/src/components/index.tsx:4:24
 import React, { FC } from "react";
 
 
-export const App: FC = () => (
-  <p>
-    Hello there
-  </p>
-);
+export const App: FC = () => undefined;
 
