[Survived] StringLiteral
Otus_react/otus_react_game_of_life/src/index.tsx:8:41
 import "./index.css";
 import { App } from "./App";
 
-render(<App />, document.getElementById("root"));
+render(<App />, document.getElementById(""));
 
