[Killed] ArrowFunction
src/components/SettingsPanel/XYSettingsSet.tsx:16:6
   legend: string;
   ySettingName: string;
   xSettngName: string;
-}> = ({ legend, ySettingName, xSettngName }) => (
-  <FieldsetStyled>
-    <legend>{legend}</legend>
-    <FieldsContainer>
-      <FieldContainer>
-        <ImageStyled src={VArrowsImg} />
-        <FieldStyled type="number" name={ySettingName} />
-      </FieldContainer>
-      <FieldContainer>
-        <ImageStyled src={HArrowsImg} />
-        <FieldStyled type="number" name={xSettngName} />
-      </FieldContainer>
-    </FieldsContainer>
-  </FieldsetStyled>
-);
+}> = () => undefined;
 
