[Survived] ObjectLiteral
modules/Game/Field/Field.stories.tsx:10:16
 import { store } from "@/store";
 import { setField } from "../gameReducer";
 
-export default {
-  title: "Field",
-  component: Field,
-  decorators: [withKnobs],
-};
+export default {};
 
 export const FieldStory: FC = () => {

[Survived] BlockStatement
modules/Game/Field/Field.stories.tsx:16:37
   decorators: [withKnobs],
 };
 
-export const FieldStory: FC = () => {
-  store.dispatch(
-    setField([
-      { cells: [CellState.alive, CellState.alive, CellState.alive] },
-      { cells: [CellState.dead, CellState.alive, CellState.dead] },
-      { cells: [CellState.alive, CellState.dead, CellState.alive] },
-    ])
-  );
-  return (
-    <Provider store={store}>
-      <Field />
-    </Provider>
-  );
-};
+export const FieldStory: FC = () => {};
 

[Survived] ObjectLiteral
modules/Game/Field/Field.stories.tsx:21:7
     setField([
       { cells: [CellState.alive, CellState.alive, CellState.alive] },
       { cells: [CellState.dead, CellState.alive, CellState.dead] },
-      { cells: [CellState.alive, CellState.dead, CellState.alive] },
+      {},
     ])
   );
