[Survived] ArrowFunction
modules/Game/Field/Field.styles.tsx:4:13
 import styled from "@emotion/styled";
 
 export const FieldStyled = styled.div<{ height: number; width: number }>`
-  height: ${(p) => p.height}px;
+  height: ${() => undefined}px;
   width: ${(p) => p.width}px;
   padding: 2px;

[Survived] ArrowFunction
modules/Game/Field/Field.styles.tsx:5:12
 
 export const FieldStyled = styled.div<{ height: number; width: number }>`
   height: ${(p) => p.height}px;
-  width: ${(p) => p.width}px;
+  width: ${() => undefined}px;
   padding: 2px;
   display: flex;
