[Killed] ArrowFunction
modules/Game/Field/Field.tsx:13:25
   getCellWidth,
 } from "../gameReducer";
 
-const mapStateToProps = (state: AppState) => ({
-  field: state.game.field,
-  fieldHeight: state.game.settings.height,
-  fieldWidht: state.game.settings.width,
-  cellHeight: getCellHeight(state),
-  cellWidht: getCellWidth(state),
-});
+const mapStateToProps = () => undefined;
 
 const mapDispatchToProps = { setField, makeCellAlive };

[Killed] BlockStatement
modules/Game/Field/Field.tsx:35:45
   cellWidht,
 }) => {
   const onCellClick = useCallback(
-    (colIndex: number, rowIndex: number) => {
-      makeCellAlive({ colIndex, rowIndex });
-    },
+    (colIndex: number, rowIndex: number) => {},
     [makeCellAlive]
   );

[Killed] ArrowFunction
modules/Game/Field/Field.tsx:42:18
   );
   return (
     <FieldStyled width={fieldWidht} height={fieldHeight}>
-      {field.map((row, rowIndex) => (
-        <RowStyled key={rowIndex}>
-          {row.cells.map((cell, colIndex) => (
-            <Cell
-              name="cell"
-              key={colIndex}
-              state={cell}
-              height={cellHeight}
-              width={cellWidht}
-              onCellClick={() => onCellClick(colIndex, rowIndex)}
-            />
-          ))}
-        </RowStyled>
-      ))}
+      {field.map(() => undefined)}
     </FieldStyled>
   );

[Killed] ArrowFunction
modules/Game/Field/Field.tsx:44:26
     <FieldStyled width={fieldWidht} height={fieldHeight}>
       {field.map((row, rowIndex) => (
         <RowStyled key={rowIndex}>
-          {row.cells.map((cell, colIndex) => (
-            <Cell
-              name="cell"
-              key={colIndex}
-              state={cell}
-              height={cellHeight}
-              width={cellWidht}
-              onCellClick={() => onCellClick(colIndex, rowIndex)}
-            />
-          ))}
+          {row.cells.map(() => undefined)}
         </RowStyled>
       ))}

[Killed] ArrowFunction
modules/Game/Field/Field.tsx:51:28
               state={cell}
               height={cellHeight}
               width={cellWidht}
-              onCellClick={() => onCellClick(colIndex, rowIndex)}
+              onCellClick={() => undefined}
             />
           ))}
