[Killed] ArrowFunction
src/modules/Game/Game.tsx:21:25
 import { logout } from "@/modules/Auth";
 import { Redirect } from "react-router-dom";
 
-const mapStateToProps = (state: AppState) => ({
-  isPlaying: state.game.isPlaying,
-  userpic: state.game.userpic,
-  user: state.auth.user,
-  isSettingsVisible: state.game.isSettingsVisible,
-  gameSettings: state.game.settings,
-  hasNextStep: gameSelectors.hasNextStep(state),
-  hasPrevStep: gameSelectors.hasPrevStep(state),
-});
+const mapStateToProps = () => undefined;
 
 const mapDispatchToProps = {

[Killed] ObjectLiteral
src/modules/Game/Game.tsx:21:47
 import { logout } from "@/modules/Auth";
 import { Redirect } from "react-router-dom";
 
-const mapStateToProps = (state: AppState) => ({
-  isPlaying: state.game.isPlaying,
-  userpic: state.game.userpic,
-  user: state.auth.user,
-  isSettingsVisible: state.game.isSettingsVisible,
-  gameSettings: state.game.settings,
-  hasNextStep: gameSelectors.hasNextStep(state),
-  hasPrevStep: gameSelectors.hasPrevStep(state),
-});
+const mapStateToProps = (state: AppState) => ({});
 
 const mapDispatchToProps = {

[Survived] BooleanLiteral
src/modules/Game/Game.tsx:61:23
   hasPrevStep,
   hasNextStep,
 }) => {
-  const [] = useState(false);
+  const [] = useState(true);
 
   const onClickPlayPause = useCallback(() => {

[Killed] BlockStatement
src/modules/Game/Game.tsx:63:46
 }) => {
   const [] = useState(false);
 
-  const onClickPlayPause = useCallback(() => {
-    isPlaying ? stopGame() : playGame();
-  }, [isPlaying, stopGame, playGame]);
+  const onClickPlayPause = useCallback(() => {}, [isPlaying, stopGame, playGame]);
 
   const onClickSettings = useCallback(() => {

[Killed] BlockStatement
src/modules/Game/Game.tsx:67:45
     isPlaying ? stopGame() : playGame();
   }, [isPlaying, stopGame, playGame]);
 
-  const onClickSettings = useCallback(() => {
-    setIsSettingsVisible(true);
-  }, [setIsSettingsVisible]);
+  const onClickSettings = useCallback(() => {}, [setIsSettingsVisible]);
 
   const onReset = useCallback(() => {

[Killed] BooleanLiteral
src/modules/Game/Game.tsx:68:26
   }, [isPlaying, stopGame, playGame]);
 
   const onClickSettings = useCallback(() => {
-    setIsSettingsVisible(true);
+    setIsSettingsVisible(false);
   }, [setIsSettingsVisible]);
 

[Survived] BlockStatement
src/modules/Game/Game.tsx:71:37
     setIsSettingsVisible(true);
   }, [setIsSettingsVisible]);
 
-  const onReset = useCallback(() => {
-    reset();
-  }, [reset]);
+  const onReset = useCallback(() => {}, [reset]);
 
   const onClickNext = useCallback(() => {

[Survived] BlockStatement
src/modules/Game/Game.tsx:75:41
     reset();
   }, [reset]);
 
-  const onClickNext = useCallback(() => {
-    nextStep();
-  }, [nextStep]);
+  const onClickNext = useCallback(() => {}, [nextStep]);
 
   const onClickPrev = useCallback(() => {

[Survived] BlockStatement
src/modules/Game/Game.tsx:79:41
     nextStep();
   }, [nextStep]);
 
-  const onClickPrev = useCallback(() => {
-    prevStep();
-  }, [prevStep]);
+  const onClickPrev = useCallback(() => {}, [prevStep]);
 
   const onDoLogout = useCallback(() => {

[Killed] BlockStatement
src/modules/Game/Game.tsx:83:40
     prevStep();
   }, [prevStep]);
 
-  const onDoLogout = useCallback(() => {
-    logout();
-  }, [logout]);
+  const onDoLogout = useCallback(() => {}, [logout]);
 
   return user ? (
