[Killed] BooleanLiteral
src/modules/Game/MainLayout.tsx:42:21
         <ImageButton
           src={BackImg}
           type="button"
-          disabled={!hasPrevStep}
+          disabled={hasPrevStep}
           title="Previous state"
           key="prev"

[Killed] BooleanLiteral
src/modules/Game/MainLayout.tsx:59:21
           type="button"
           title="Next state"
           key="next"
-          disabled={!hasNextStep}
+          disabled={hasNextStep}
           onClick={onClickNext}
         ></ImageButton>
