[Survived] LogicalOperator
src/modules/Game/RightSideLayout.tsx:45:14
         onClick={onLogout}
       ></ImageButton>
     </SettingsContainer>
-    {userPic && <ImageStyled src={userPic}></ImageStyled>}
+    {userPic || <ImageStyled src={userPic}></ImageStyled>}
   </RightSideContainer>
 );

[Survived] ConditionalExpression
src/modules/Game/RightSideLayout.tsx:45:6
         onClick={onLogout}
       ></ImageButton>
     </SettingsContainer>
-    {userPic && <ImageStyled src={userPic}></ImageStyled>}
+    {true}
   </RightSideContainer>
 );
