[Killed] ArrayDeclaration
src/modules/Game/gameReducer.ts:10:28
 
 export const getRandomField = (settings: GameSettings) => {
 	const { columnCount, rowCount, fillingPercent } = settings;
-	const result: CellRow[] = [];
+	const result: CellRow[] = ["Stryker was here"];
 	const cellsCount = columnCount * rowCount;
 	const maxAliveCount = (cellsCount / 100) * fillingPercent;

[Killed] ArithmeticOperator
src/modules/Game/gameReducer.ts:11:33
 export const getRandomField = (settings: GameSettings) => {
 	const { columnCount, rowCount, fillingPercent } = settings;
 	const result: CellRow[] = [];
-	const cellsCount = columnCount * rowCount;
+	const cellsCount = columnCount / rowCount;
 	const maxAliveCount = (cellsCount / 100) * fillingPercent;
 	let aliveCount = 0;

[Killed] ArithmeticOperator
src/modules/Game/gameReducer.ts:12:36
 	const { columnCount, rowCount, fillingPercent } = settings;
 	const result: CellRow[] = [];
 	const cellsCount = columnCount * rowCount;
-	const maxAliveCount = (cellsCount / 100) * fillingPercent;
+	const maxAliveCount = (cellsCount * 100) * fillingPercent;
 	let aliveCount = 0;
 

[Killed] ArithmeticOperator
src/modules/Game/gameReducer.ts:12:43
 	const { columnCount, rowCount, fillingPercent } = settings;
 	const result: CellRow[] = [];
 	const cellsCount = columnCount * rowCount;
-	const maxAliveCount = (cellsCount / 100) * fillingPercent;
+	const maxAliveCount = (cellsCount / 100) / fillingPercent;
 	let aliveCount = 0;
 

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:15:37
 	const maxAliveCount = (cellsCount / 100) * fillingPercent;
 	let aliveCount = 0;
 
-	for (let y = 0; y < rowCount; y++) {
-		const rowCells: CellState[] = [];
-
-		for (let x = 0; x < columnCount; x++) {
-			let cellState = CellState.dead;
-
-			if (Math.round(Math.random() * 100) <= fillingPercent) {
-				aliveCount++;
-				if (aliveCount <= maxAliveCount) {
-					cellState = CellState.alive;
-				}
-			}
-
-			rowCells.push(cellState);
-		}
-		result.push({ cells: rowCells });
-	}
+	for (let y = 0; y < rowCount; y++) {}
 	return result;
 };

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:15:18
 	const maxAliveCount = (cellsCount / 100) * fillingPercent;
 	let aliveCount = 0;
 
-	for (let y = 0; y < rowCount; y++) {
+	for (let y = 0; false; y++) {
 		const rowCells: CellState[] = [];
 

[Killed] ArrayDeclaration
src/modules/Game/gameReducer.ts:16:33
 	let aliveCount = 0;
 
 	for (let y = 0; y < rowCount; y++) {
-		const rowCells: CellState[] = [];
+		const rowCells: CellState[] = ["Stryker was here"];
 
 		for (let x = 0; x < columnCount; x++) {

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:18:41
 	for (let y = 0; y < rowCount; y++) {
 		const rowCells: CellState[] = [];
 
-		for (let x = 0; x < columnCount; x++) {
-			let cellState = CellState.dead;
-
-			if (Math.round(Math.random() * 100) <= fillingPercent) {
-				aliveCount++;
-				if (aliveCount <= maxAliveCount) {
-					cellState = CellState.alive;
-				}
-			}
-
-			rowCells.push(cellState);
-		}
+		for (let x = 0; x < columnCount; x++) {}
 		result.push({ cells: rowCells });
 	}

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:18:19
 	for (let y = 0; y < rowCount; y++) {
 		const rowCells: CellState[] = [];
 
-		for (let x = 0; x < columnCount; x++) {
+		for (let x = 0; false; x++) {
 			let cellState = CellState.dead;
 

[Killed] ArithmeticOperator
src/modules/Game/gameReducer.ts:21:33
 		for (let x = 0; x < columnCount; x++) {
 			let cellState = CellState.dead;
 
-			if (Math.round(Math.random() * 100) <= fillingPercent) {
+			if (Math.round(Math.random() / 100) <= fillingPercent) {
 				aliveCount++;
 				if (aliveCount <= maxAliveCount) {

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:21:8
 		for (let x = 0; x < columnCount; x++) {
 			let cellState = CellState.dead;
 
-			if (Math.round(Math.random() * 100) <= fillingPercent) {
+			if (false) {
 				aliveCount++;
 				if (aliveCount <= maxAliveCount) {

[Killed] UpdateOperator
src/modules/Game/gameReducer.ts:22:5
 			let cellState = CellState.dead;
 
 			if (Math.round(Math.random() * 100) <= fillingPercent) {
-				aliveCount++;
+				aliveCount--;
 				if (aliveCount <= maxAliveCount) {
 					cellState = CellState.alive;

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:23:38
 
 			if (Math.round(Math.random() * 100) <= fillingPercent) {
 				aliveCount++;
-				if (aliveCount <= maxAliveCount) {
-					cellState = CellState.alive;
-				}
+				if (aliveCount <= maxAliveCount) {}
 			}
 

[Killed] EqualityOperator
src/modules/Game/gameReducer.ts:23:20
 
 			if (Math.round(Math.random() * 100) <= fillingPercent) {
 				aliveCount++;
-				if (aliveCount <= maxAliveCount) {
+				if (aliveCount > maxAliveCount) {
 					cellState = CellState.alive;
 				}

[Killed] ObjectLiteral
src/modules/Game/gameReducer.ts:54:41
 	currentHistoryStep: number;
 }
 
-export const initGameState: GameState = {
-	settings: initSettingsState,
-	isPlaying: false,
-	isSettingsVisible: false,
-	userpic: "",
-	field: getRandomField(initSettingsState),
-	history: [],
-	currentHistoryStep: -1
-};
+export const initGameState: GameState = {};
 
 const makeCellAliveField = (

[Killed] BooleanLiteral
src/modules/Game/gameReducer.ts:56:13
 
 export const initGameState: GameState = {
 	settings: initSettingsState,
-	isPlaying: false,
+	isPlaying: true,
 	isSettingsVisible: false,
 	userpic: "",

[Survived] BooleanLiteral
src/modules/Game/gameReducer.ts:57:21
 export const initGameState: GameState = {
 	settings: initSettingsState,
 	isPlaying: false,
-	isSettingsVisible: false,
+	isSettingsVisible: true,
 	userpic: "",
 	field: getRandomField(initSettingsState),

[Survived] StringLiteral
src/modules/Game/gameReducer.ts:58:11
 	settings: initSettingsState,
 	isPlaying: false,
 	isSettingsVisible: false,
-	userpic: "",
+	userpic: "Stryker was here!",
 	field: getRandomField(initSettingsState),
 	history: [],

[Killed] ArrayDeclaration
src/modules/Game/gameReducer.ts:60:11
 	isSettingsVisible: false,
 	userpic: "",
 	field: getRandomField(initSettingsState),
-	history: [],
+	history: ["Stryker was here"],
 	currentHistoryStep: -1
 };

[Killed] UnaryOperator
src/modules/Game/gameReducer.ts:61:22
 	userpic: "",
 	field: getRandomField(initSettingsState),
 	history: [],
-	currentHistoryStep: -1
+	currentHistoryStep: +1
 };
 

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:68:6
 	oldField: CellRow[],
 	colIndex: number,
 	rowIndex: number
-) => {
-	if (oldField[rowIndex].cells[colIndex] !== CellState.alive) {
-		const newRows = [...oldField];
-		const rowCells = [...newRows[rowIndex].cells];
-		rowCells[colIndex] = CellState.alive;
-		newRows[rowIndex] = { cells: rowCells };
-
-		return newRows;
-	}
-	return oldField;
-};
+) => {};
 
 const gameSlice = createSlice({

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:69:62
 	colIndex: number,
 	rowIndex: number
 ) => {
-	if (oldField[rowIndex].cells[colIndex] !== CellState.alive) {
-		const newRows = [...oldField];
-		const rowCells = [...newRows[rowIndex].cells];
-		rowCells[colIndex] = CellState.alive;
-		newRows[rowIndex] = { cells: rowCells };
-
-		return newRows;
-	}
+	if (oldField[rowIndex].cells[colIndex] !== CellState.alive) {}
 	return oldField;
 };

[Killed] EqualityOperator
src/modules/Game/gameReducer.ts:69:41
 	colIndex: number,
 	rowIndex: number
 ) => {
-	if (oldField[rowIndex].cells[colIndex] !== CellState.alive) {
+	if (oldField[rowIndex].cells[colIndex] === CellState.alive) {
 		const newRows = [...oldField];
 		const rowCells = [...newRows[rowIndex].cells];

[Survived] ArrayDeclaration
src/modules/Game/gameReducer.ts:71:20
 ) => {
 	if (oldField[rowIndex].cells[colIndex] !== CellState.alive) {
 		const newRows = [...oldField];
-		const rowCells = [...newRows[rowIndex].cells];
+		const rowCells = [];
 		rowCells[colIndex] = CellState.alive;
 		newRows[rowIndex] = { cells: rowCells };

[Killed] ObjectLiteral
src/modules/Game/gameReducer.ts:73:23
 		const newRows = [...oldField];
 		const rowCells = [...newRows[rowIndex].cells];
 		rowCells[colIndex] = CellState.alive;
-		newRows[rowIndex] = { cells: rowCells };
+		newRows[rowIndex] = {};
 
 		return newRows;

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:84:19
 	name: "game",
 	initialState: initGameState,
 	reducers: {
-		playGame(state) {
-			state.isPlaying = true;
-
-			state.history = [state.field];
-			
-			state.currentHistoryStep = 0;
-		},
+		playGame(state) {},
 		stopGame(state) {
 			state.isPlaying = false;

[Killed] BooleanLiteral
src/modules/Game/gameReducer.ts:85:22
 	initialState: initGameState,
 	reducers: {
 		playGame(state) {
-			state.isPlaying = true;
+			state.isPlaying = false;
 
 			state.history = [state.field];

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:91:19
 			
 			state.currentHistoryStep = 0;
 		},
-		stopGame(state) {
-			state.isPlaying = false;
-		},
+		stopGame(state) {},
 		setIsSettingsVisible(state, action) {
 			state.isSettingsVisible = action.payload;

[Killed] BooleanLiteral
src/modules/Game/gameReducer.ts:92:22
 			state.currentHistoryStep = 0;
 		},
 		stopGame(state) {
-			state.isPlaying = false;
+			state.isPlaying = true;
 		},
 		setIsSettingsVisible(state, action) {

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:94:39
 		stopGame(state) {
 			state.isPlaying = false;
 		},
-		setIsSettingsVisible(state, action) {
-			state.isSettingsVisible = action.payload;
-		},
+		setIsSettingsVisible(state, action) {},
 		reset(state) {
 			state.field = getRandomField(state.settings);

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:97:16
 		setIsSettingsVisible(state, action) {
 			state.isSettingsVisible = action.payload;
 		},
-		reset(state) {
-			state.field = getRandomField(state.settings);
-
-			state.history = [state.field];
-			state.currentHistoryStep = 0;
-		},
+		reset(state) {},
 		setUserpic(state, action) {
 			state.userpic = action.payload;

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:103:29
 			state.history = [state.field];
 			state.currentHistoryStep = 0;
 		},
-		setUserpic(state, action) {
-			state.userpic = action.payload;
-		},
+		setUserpic(state, action) {},
 		setSettings(state, action) {
 			state.settings = action.payload;

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:106:30
 		setUserpic(state, action) {
 			state.userpic = action.payload;
 		},
-		setSettings(state, action) {
-			state.settings = action.payload;
-			state.field = getRandomField(action.payload);
-
-			state.history = [state.field];
-			state.currentHistoryStep = 0;
-		},
+		setSettings(state, action) {},
 		setField(state, action) {
 			state.field = action.payload;

[Killed] ArrayDeclaration
src/modules/Game/gameReducer.ts:110:20
 			state.settings = action.payload;
 			state.field = getRandomField(action.payload);
 
-			state.history = [state.field];
+			state.history = [];
 			state.currentHistoryStep = 0;
 		},

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:113:27
 			state.history = [state.field];
 			state.currentHistoryStep = 0;
 		},
-		setField(state, action) {
-			state.field = action.payload;
-
-			state.history.push(state.field);
-			state.currentHistoryStep++;
-		},
+		setField(state, action) {},
 		makeCellAlive(state, action) {
 			state.field = makeCellAliveField(

[Killed] UpdateOperator
src/modules/Game/gameReducer.ts:117:4
 			state.field = action.payload;
 
 			state.history.push(state.field);
-			state.currentHistoryStep++;
+			state.currentHistoryStep--;
 		},
 		makeCellAlive(state, action) {

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:119:32
 			state.history.push(state.field);
 			state.currentHistoryStep++;
 		},
-		makeCellAlive(state, action) {
-			state.field = makeCellAliveField(
-				state.field,
-				action.payload.colIndex,
-				action.payload.rowIndex
-			);
-
-			state.history.push(state.field);
-			state.currentHistoryStep++;
-		},
+		makeCellAlive(state, action) {},
 		nextStep(state) {
 			if (!state.isPlaying && state.currentHistoryStep < state.history.length - 1) {

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:129:19
 			state.history.push(state.field);
 			state.currentHistoryStep++;
 		},
-		nextStep(state) {
-			if (!state.isPlaying && state.currentHistoryStep < state.history.length - 1) {
-
-				state.currentHistoryStep++;
-				state.field = state.history[state.currentHistoryStep];
-			}
-		},
+		nextStep(state) {},
 		prevStep(state) {
 			if (!state.isPlaying && state.currentHistoryStep > 0) {

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:130:81
 			state.currentHistoryStep++;
 		},
 		nextStep(state) {
-			if (!state.isPlaying && state.currentHistoryStep < state.history.length - 1) {
-
-				state.currentHistoryStep++;
-				state.field = state.history[state.currentHistoryStep];
-			}
+			if (!state.isPlaying && state.currentHistoryStep < state.history.length - 1) {}
 		},
 		prevStep(state) {

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:130:8
 			state.currentHistoryStep++;
 		},
 		nextStep(state) {
-			if (!state.isPlaying && state.currentHistoryStep < state.history.length - 1) {
+			if (false) {
 
 				state.currentHistoryStep++;

[Killed] UpdateOperator
src/modules/Game/gameReducer.ts:132:5
 		nextStep(state) {
 			if (!state.isPlaying && state.currentHistoryStep < state.history.length - 1) {
 
-				state.currentHistoryStep++;
+				state.currentHistoryStep--;
 				state.field = state.history[state.currentHistoryStep];
 			}

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:136:19
 				state.field = state.history[state.currentHistoryStep];
 			}
 		},
-		prevStep(state) {
-			if (!state.isPlaying && state.currentHistoryStep > 0) {
-
-				state.currentHistoryStep--;
-				state.field = state.history[state.currentHistoryStep];
-			}
-		},
+		prevStep(state) {},
 	},
 });

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:137:58
 			}
 		},
 		prevStep(state) {
-			if (!state.isPlaying && state.currentHistoryStep > 0) {
-
-				state.currentHistoryStep--;
-				state.field = state.history[state.currentHistoryStep];
-			}
+			if (!state.isPlaying && state.currentHistoryStep > 0) {}
 		},
 	},

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:137:8
 			}
 		},
 		prevStep(state) {
-			if (!state.isPlaying && state.currentHistoryStep > 0) {
+			if (true) {
 
 				state.currentHistoryStep--;

[Killed] UpdateOperator
src/modules/Game/gameReducer.ts:139:5
 		prevStep(state) {
 			if (!state.isPlaying && state.currentHistoryStep > 0) {
 
-				state.currentHistoryStep--;
+				state.currentHistoryStep++;
 				state.field = state.history[state.currentHistoryStep];
 			}

[Killed] ArrowFunction
src/modules/Game/gameReducer.ts:161:12
 export const gameReducer = gameSlice.reducer;
 
 export const gameSelectors = {
-	settings: ({ game }: AppState) => game.settings,
+	settings: () => undefined,
 	field: ({ game }: AppState) => game.field,
 	gameIsPlaying: ({ game }: AppState) => game.isPlaying,

[Killed] ArrowFunction
src/modules/Game/gameReducer.ts:162:9
 
 export const gameSelectors = {
 	settings: ({ game }: AppState) => game.settings,
-	field: ({ game }: AppState) => game.field,
+	field: () => undefined,
 	gameIsPlaying: ({ game }: AppState) => game.isPlaying,
 	hasPrevStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep > 0,

[Survived] ArrowFunction
src/modules/Game/gameReducer.ts:163:17
 export const gameSelectors = {
 	settings: ({ game }: AppState) => game.settings,
 	field: ({ game }: AppState) => game.field,
-	gameIsPlaying: ({ game }: AppState) => game.isPlaying,
+	gameIsPlaying: () => undefined,
 	hasPrevStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep > 0,
 	hasNextStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep < game.history.length - 1,

[Killed] EqualityOperator
src/modules/Game/gameReducer.ts:164:82
 	settings: ({ game }: AppState) => game.settings,
 	field: ({ game }: AppState) => game.field,
 	gameIsPlaying: ({ game }: AppState) => game.isPlaying,
-	hasPrevStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep > 0,
+	hasPrevStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep <= 0,
 	hasNextStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep < game.history.length - 1,
 };

[Killed] BooleanLiteral
src/modules/Game/gameReducer.ts:164:39
 	settings: ({ game }: AppState) => game.settings,
 	field: ({ game }: AppState) => game.field,
 	gameIsPlaying: ({ game }: AppState) => game.isPlaying,
-	hasPrevStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep > 0,
+	hasPrevStep: ({ game }: AppState) => game.isPlaying && game.currentHistoryStep > 0,
 	hasNextStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep < game.history.length - 1,
 };

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:165:58
 	field: ({ game }: AppState) => game.field,
 	gameIsPlaying: ({ game }: AppState) => game.isPlaying,
 	hasPrevStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep > 0,
-	hasNextStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep < game.history.length - 1,
+	hasNextStep: ({ game }: AppState) => !game.isPlaying && false,
 };
 

[Killed] EqualityOperator
src/modules/Game/gameReducer.ts:165:82
 	field: ({ game }: AppState) => game.field,
 	gameIsPlaying: ({ game }: AppState) => game.isPlaying,
 	hasPrevStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep > 0,
-	hasNextStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep < game.history.length - 1,
+	hasNextStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep >= game.history.length - 1,
 };
 

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:168:86
 	hasNextStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep < game.history.length - 1,
 };
 
-const getNextCellState = (oldCell: CellState, neighbours: CellState[]): CellState => {
-	const aliveNeighbourCount = neighbours.filter(
-		(x) => x === CellState.alive
-	).length;
-
-	if ((oldCell === CellState.alive &&
-		(aliveNeighbourCount === 2 || aliveNeighbourCount === 3)) ||
-		(oldCell === CellState.dead && aliveNeighbourCount === 3)
-	) {
-		return CellState.alive;
-	}
-
-	return CellState.dead;
-}
+const getNextCellState = (oldCell: CellState, neighbours: CellState[]): CellState => {}
 
 export const getCellWidth = createSelector(

[Killed] EqualityOperator
src/modules/Game/gameReducer.ts:170:12
 
 const getNextCellState = (oldCell: CellState, neighbours: CellState[]): CellState => {
 	const aliveNeighbourCount = neighbours.filter(
-		(x) => x === CellState.alive
+		(x) => x !== CellState.alive
 	).length;
 

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:170:10
 
 const getNextCellState = (oldCell: CellState, neighbours: CellState[]): CellState => {
 	const aliveNeighbourCount = neighbours.filter(
-		(x) => x === CellState.alive
+		(x) => false
 	).length;
 

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:173:7
 		(x) => x === CellState.alive
 	).length;
 
-	if ((oldCell === CellState.alive &&
-		(aliveNeighbourCount === 2 || aliveNeighbourCount === 3)) ||
+	if ((false) ||
 		(oldCell === CellState.dead && aliveNeighbourCount === 3)
 	) {

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:173:7
 		(x) => x === CellState.alive
 	).length;
 
-	if ((oldCell === CellState.alive &&
+	if ((false &&
 		(aliveNeighbourCount === 2 || aliveNeighbourCount === 3)) ||
 		(oldCell === CellState.dead && aliveNeighbourCount === 3)

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:174:4
 	).length;
 
 	if ((oldCell === CellState.alive &&
-		(aliveNeighbourCount === 2 || aliveNeighbourCount === 3)) ||
+		(true)) ||
 		(oldCell === CellState.dead && aliveNeighbourCount === 3)
 	) {

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:174:4
 	).length;
 
 	if ((oldCell === CellState.alive &&
-		(aliveNeighbourCount === 2 || aliveNeighbourCount === 3)) ||
+		(true || aliveNeighbourCount === 3)) ||
 		(oldCell === CellState.dead && aliveNeighbourCount === 3)
 	) {

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:175:34
 
 	if ((oldCell === CellState.alive &&
 		(aliveNeighbourCount === 2 || aliveNeighbourCount === 3)) ||
-		(oldCell === CellState.dead && aliveNeighbourCount === 3)
+		(oldCell === CellState.dead && false)
 	) {
 		return CellState.alive;

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:175:34
 
 	if ((oldCell === CellState.alive &&
 		(aliveNeighbourCount === 2 || aliveNeighbourCount === 3)) ||
-		(oldCell === CellState.dead && aliveNeighbourCount === 3)
+		(oldCell === CellState.dead && true)
 	) {
 		return CellState.alive;

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:176:4
 	if ((oldCell === CellState.alive &&
 		(aliveNeighbourCount === 2 || aliveNeighbourCount === 3)) ||
 		(oldCell === CellState.dead && aliveNeighbourCount === 3)
-	) {
-		return CellState.alive;
-	}
+	) {}
 
 	return CellState.dead;

[Survived] ArrowFunction
src/modules/Game/gameReducer.ts:185:3
 
 export const getCellWidth = createSelector(
 	[
-		({ game }: AppState) => game.settings.columnCount,
+		() => undefined,
 		({ game }: AppState) => game.settings.width,
 	],

[Survived] ArrowFunction
src/modules/Game/gameReducer.ts:186:3
 export const getCellWidth = createSelector(
 	[
 		({ game }: AppState) => game.settings.columnCount,
-		({ game }: AppState) => game.settings.width,
+		() => undefined,
 	],
 	(count, width) => {

[Survived] BlockStatement
src/modules/Game/gameReducer.ts:188:20
 		({ game }: AppState) => game.settings.columnCount,
 		({ game }: AppState) => game.settings.width,
 	],
-	(count, width) => {
-		return (width - (count + 1) * 4) / count;
-	}
+	(count, width) => {}
 );
 

[Survived] ArithmeticOperator
src/modules/Game/gameReducer.ts:189:36
 		({ game }: AppState) => game.settings.width,
 	],
 	(count, width) => {
-		return (width - (count + 1) * 4) / count;
+		return (width - (count + 1) * 4) * count;
 	}
 );

[Survived] ArithmeticOperator
src/modules/Game/gameReducer.ts:189:17
 		({ game }: AppState) => game.settings.width,
 	],
 	(count, width) => {
-		return (width - (count + 1) * 4) / count;
+		return (width + (count + 1) * 4) / count;
 	}
 );

[Survived] ArrowFunction
src/modules/Game/gameReducer.ts:195:3
 
 export const getCellHeight = createSelector(
 	[
-		({ game }: AppState) => game.settings.rowCount,
+		() => undefined,
 		({ game }: AppState) => game.settings.height,
 	],

[Survived] ArrowFunction
src/modules/Game/gameReducer.ts:196:3
 export const getCellHeight = createSelector(
 	[
 		({ game }: AppState) => game.settings.rowCount,
-		({ game }: AppState) => game.settings.height,
+		() => undefined,
 	],
 	(count, height) => {

[Survived] BlockStatement
src/modules/Game/gameReducer.ts:198:21
 		({ game }: AppState) => game.settings.rowCount,
 		({ game }: AppState) => game.settings.height,
 	],
-	(count, height) => {
-		return (height - (count + 1) * 4) / count;
-	}
+	(count, height) => {}
 );
 

[Survived] ArithmeticOperator
src/modules/Game/gameReducer.ts:199:37
 		({ game }: AppState) => game.settings.height,
 	],
 	(count, height) => {
-		return (height - (count + 1) * 4) / count;
+		return (height - (count + 1) * 4) * count;
 	}
 );

[Survived] ArithmeticOperator
src/modules/Game/gameReducer.ts:199:27
 		({ game }: AppState) => game.settings.height,
 	],
 	(count, height) => {
-		return (height - (count + 1) * 4) / count;
+		return (height - (count - 1) * 4) / count;
 	}
 );

[Killed] ArrayDeclaration
src/modules/Game/gameReducer.ts:204:2
 );
 
 export const getNextGeneration = createSelector(
-	[gameSelectors.field, gameSelectors.settings],
+	[],
 	(oldField, settings) => {
 		const getCellIndex = (index: number) =>

[Survived] ArrowFunction
src/modules/Game/gameReducer.ts:206:24
 export const getNextGeneration = createSelector(
 	[gameSelectors.field, gameSelectors.settings],
 	(oldField, settings) => {
-		const getCellIndex = (index: number) =>
-			index < 0
-				? 0
-				: index > settings.columnCount
-					? settings.columnCount
-					: index;
+		const getCellIndex = () => undefined;
 
 		return oldField.reduce(

[Killed] EqualityOperator
src/modules/Game/gameReducer.ts:207:10
 	[gameSelectors.field, gameSelectors.settings],
 	(oldField, settings) => {
 		const getCellIndex = (index: number) =>
-			index < 0
+			index >= 0
 				? 0
 				: index > settings.columnCount

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:207:4
 	[gameSelectors.field, gameSelectors.settings],
 	(oldField, settings) => {
 		const getCellIndex = (index: number) =>
-			index < 0
+			false
 				? 0
 				: index > settings.columnCount

[Killed] EqualityOperator
src/modules/Game/gameReducer.ts:209:13
 		const getCellIndex = (index: number) =>
 			index < 0
 				? 0
-				: index > settings.columnCount
+				: index <= settings.columnCount
 					? settings.columnCount
 					: index;

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:209:7
 		const getCellIndex = (index: number) =>
 			index < 0
 				? 0
-				: index > settings.columnCount
+				: true
 					? settings.columnCount
 					: index;

[Killed] BlockStatement
src/modules/Game/gameReducer.ts:226:11
 						currentCell: CellState,
 						cellIndex: number,
 						allCells: CellState[]
-					) => {
-						const neighbours: CellState[] = [];
-						allRows[rowIndex - 1] &&
-							neighbours.push(
-								...allRows[rowIndex - 1].cells.slice(
-									getCellIndex(cellIndex - 1),
-									getCellIndex(cellIndex + 2)
-								)
-							);
-						allRows[rowIndex + 1] &&
-							neighbours.push(
-								...allRows[rowIndex + 1].cells.slice(
-									getCellIndex(cellIndex - 1),
-									getCellIndex(cellIndex + 2)
-								)
-							);
-						allCells[cellIndex - 1] && neighbours.push(allCells[cellIndex - 1]);
-						allCells[cellIndex + 1] && neighbours.push(allCells[cellIndex + 1]);
-						newRowCells.push(getNextCellState(currentCell, neighbours));
-						return newRowCells;
-					},
+					) => {},
 					[]
 				);

[Killed] LogicalOperator
src/modules/Game/gameReducer.ts:228:29
 						allCells: CellState[]
 					) => {
 						const neighbours: CellState[] = [];
-						allRows[rowIndex - 1] &&
+						allRows[rowIndex - 1] ||
 							neighbours.push(
 								...allRows[rowIndex - 1].cells.slice(

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:228:7
 						allCells: CellState[]
 					) => {
 						const neighbours: CellState[] = [];
-						allRows[rowIndex - 1] &&
-							neighbours.push(
-								...allRows[rowIndex - 1].cells.slice(
-									getCellIndex(cellIndex - 1),
-									getCellIndex(cellIndex + 2)
-								)
-							);
+						true;
 						allRows[rowIndex + 1] &&
 							neighbours.push(

[Killed] ArithmeticOperator
src/modules/Game/gameReducer.ts:230:29
 						const neighbours: CellState[] = [];
 						allRows[rowIndex - 1] &&
 							neighbours.push(
-								...allRows[rowIndex - 1].cells.slice(
+								...allRows[rowIndex + 1].cells.slice(
 									getCellIndex(cellIndex - 1),
 									getCellIndex(cellIndex + 2)

[Killed] ArithmeticOperator
src/modules/Game/gameReducer.ts:231:33
 						allRows[rowIndex - 1] &&
 							neighbours.push(
 								...allRows[rowIndex - 1].cells.slice(
-									getCellIndex(cellIndex - 1),
+									getCellIndex(cellIndex + 1),
 									getCellIndex(cellIndex + 2)
 								)

[Killed] ArithmeticOperator
src/modules/Game/gameReducer.ts:232:33
 							neighbours.push(
 								...allRows[rowIndex - 1].cells.slice(
 									getCellIndex(cellIndex - 1),
-									getCellIndex(cellIndex + 2)
+									getCellIndex(cellIndex - 2)
 								)
 							);

[Killed] ArithmeticOperator
src/modules/Game/gameReducer.ts:235:24
 									getCellIndex(cellIndex + 2)
 								)
 							);
-						allRows[rowIndex + 1] &&
+						allRows[rowIndex - 1] &&
 							neighbours.push(
 								...allRows[rowIndex + 1].cells.slice(

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:235:7
 									getCellIndex(cellIndex + 2)
 								)
 							);
-						allRows[rowIndex + 1] &&
-							neighbours.push(
-								...allRows[rowIndex + 1].cells.slice(
-									getCellIndex(cellIndex - 1),
-									getCellIndex(cellIndex + 2)
-								)
-							);
+						true;
 						allCells[cellIndex - 1] && neighbours.push(allCells[cellIndex - 1]);
 						allCells[cellIndex + 1] && neighbours.push(allCells[cellIndex + 1]);

[Killed] ArithmeticOperator
src/modules/Game/gameReducer.ts:237:29
 							);
 						allRows[rowIndex + 1] &&
 							neighbours.push(
-								...allRows[rowIndex + 1].cells.slice(
+								...allRows[rowIndex - 1].cells.slice(
 									getCellIndex(cellIndex - 1),
 									getCellIndex(cellIndex + 2)

[Killed] ArithmeticOperator
src/modules/Game/gameReducer.ts:238:33
 						allRows[rowIndex + 1] &&
 							neighbours.push(
 								...allRows[rowIndex + 1].cells.slice(
-									getCellIndex(cellIndex - 1),
+									getCellIndex(cellIndex + 1),
 									getCellIndex(cellIndex + 2)
 								)

[Killed] ArithmeticOperator
src/modules/Game/gameReducer.ts:242:69
 									getCellIndex(cellIndex + 2)
 								)
 							);
-						allCells[cellIndex - 1] && neighbours.push(allCells[cellIndex - 1]);
+						allCells[cellIndex - 1] && neighbours.push(allCells[cellIndex + 1]);
 						allCells[cellIndex + 1] && neighbours.push(allCells[cellIndex + 1]);
 						newRowCells.push(getNextCellState(currentCell, neighbours));
