[Killed] ArithmeticOperator
src/modules/Game/gameReducer.ts:242:26
 									getCellIndex(cellIndex + 2)
 								)
 							);
-						allCells[cellIndex - 1] && neighbours.push(allCells[cellIndex - 1]);
+						allCells[cellIndex + 1] && neighbours.push(allCells[cellIndex - 1]);
 						allCells[cellIndex + 1] && neighbours.push(allCells[cellIndex + 1]);
 						newRowCells.push(getNextCellState(currentCell, neighbours));

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:243:7
 								)
 							);
 						allCells[cellIndex - 1] && neighbours.push(allCells[cellIndex - 1]);
-						allCells[cellIndex + 1] && neighbours.push(allCells[cellIndex + 1]);
+						true;
 						newRowCells.push(getNextCellState(currentCell, neighbours));
 						return newRowCells;

[Killed] ConditionalExpression
src/modules/Game/gameReducer.ts:243:7
 								)
 							);
 						allCells[cellIndex - 1] && neighbours.push(allCells[cellIndex - 1]);
-						allCells[cellIndex + 1] && neighbours.push(allCells[cellIndex + 1]);
+						false;
 						newRowCells.push(getNextCellState(currentCell, neighbours));
 						return newRowCells;
