[Killed] BlockStatement
src/modules/Game/gameSaga.ts:13:24
 } from "redux-saga/effects";
 import { setField, gameSelectors, getNextGeneration, playGame, stopGame } from "./gameReducer";
 
-function* playWorker() {
-	while (true) {
-		const { frequency } = yield select(gameSelectors.settings);
-		const nextFieldRows = yield select(getNextGeneration);
-		yield put(setField(nextFieldRows));
-		yield delay(frequency * 100);
-	}
-}
+function* playWorker() {}
 
 function* playGameFlow() {

[Killed] ConditionalExpression
src/modules/Game/gameSaga.ts:14:9
 import { setField, gameSelectors, getNextGeneration, playGame, stopGame } from "./gameReducer";
 
 function* playWorker() {
-	while (true) {
+	while (false) {
 		const { frequency } = yield select(gameSelectors.settings);
 		const nextFieldRows = yield select(getNextGeneration);

[Survived] ArithmeticOperator
src/modules/Game/gameSaga.ts:18:25
 		const { frequency } = yield select(gameSelectors.settings);
 		const nextFieldRows = yield select(getNextGeneration);
 		yield put(setField(nextFieldRows));
-		yield delay(frequency * 100);
+		yield delay(frequency / 100);
 	}
 }

[Killed] BlockStatement
src/modules/Game/gameSaga.ts:22:26
 	}
 }
 
-function* playGameFlow() {
-	const playTask = yield fork(playWorker);
-	yield take(stopGame.type);
-	yield cancel(playTask);
-}
+function* playGameFlow() {}
 
 function* startGameSaga() {

[Killed] BlockStatement
src/modules/Game/gameSaga.ts:28:27
 	yield cancel(playTask);
 }
 
-function* startGameSaga() {
-	yield takeEvery(playGame.type, playGameFlow);
-}
+function* startGameSaga() {}
 
 export function* gameSaga() {

[Killed] BlockStatement
src/modules/Game/gameSaga.ts:32:29
 	yield takeEvery(playGame.type, playGameFlow);
 }
 
-export function* gameSaga() {
-	yield all([startGameSaga()]);
-}
+export function* gameSaga() {}
 
