[Survived] ArrowFunction
otus_react_game_of_life/src/screens/GameScreen.tsx:4:27
 import React from "react";
 import { Game } from "@/modules/Game";
 
-export const GameScreen = () => <Game />;
+export const GameScreen = () => undefined;
 
