[Killed] ObjectLiteral
Otus_react/otus_react_game_of_life/src/store.ts:20:40
 
 export const sagaMiddleware = createSagaMiddleware();
 
-export const reducer = combineReducers({
-  game: gameReducer,
-  auth: authReducer,
-});
+export const reducer = combineReducers({});
 
 export const restore = createAction("restore");

[Killed] BlockStatement
Otus_react/otus_react_game_of_life/src/store.ts:26:57
 });
 
 export const restore = createAction("restore");
-export const rootReducer = (state: any, action: any) => {
-  if (action.type === restore.type) {
-    state = { ...initialAppState };
-  }
-
-  return reducer(state, action);
-};
+export const rootReducer = (state: any, action: any) => {};
 
 function* rootSaga() {

[Killed] EqualityOperator
Otus_react/otus_react_game_of_life/src/store.ts:27:19
 
 export const restore = createAction("restore");
 export const rootReducer = (state: any, action: any) => {
-  if (action.type === restore.type) {
+  if (action.type !== restore.type) {
     state = { ...initialAppState };
   }

[Killed] ConditionalExpression
Otus_react/otus_react_game_of_life/src/store.ts:27:7
 
 export const restore = createAction("restore");
 export const rootReducer = (state: any, action: any) => {
-  if (action.type === restore.type) {
+  if (true) {
     state = { ...initialAppState };
   }

[Survived] BlockStatement
Otus_react/otus_react_game_of_life/src/store.ts:34:22
   return reducer(state, action);
 };
 
-function* rootSaga() {
-  yield fork(gameSaga);
-  yield fork(authSaga);
-}
+function* rootSaga() {}
 
 export const store = configureStore({
