[Survived] StringLiteral
src/components/SettingsPanel/SettingsPanel.styles.tsx:45:46
   margin-left: 5px;
 `;
 
-export const FieldsetStyled = styled.fieldset`
-  margin: 1rem 0;
-  border-radius: 5px;
-`;
+export const FieldsetStyled = styled.fieldset"";
 
 export const FieldsContainer = styled(FlexContainer)`

[Survived] StringLiteral
src/components/SettingsPanel/SettingsPanel.styles.tsx:63:40
   height: 2rem;
 `;
 
-export const LabelStyled = styled.label`
-  display: contents;
-  width: 70px;
-`;
+export const LabelStyled = styled.label"";
 
 export const InputStyled = styled.input`
