[Survived] StringLiteral
modules/Game/Field/Field.styles.tsx:17:36
   background-color: white;
 `;
 
-export const RowStyled = styled.div`
-  display: flex;
-  align-items: start;
-`;
+export const RowStyled = styled.div"";
 
