[Survived] UpdateOperator
src/modules/Game/gameReducer.ts:15:32
 	const maxAliveCount = (cellsCount / 100) * fillingPercent;
 	let aliveCount = 0;
 
-	for (let y = 0; y < rowCount; y++) {
+	for (let y = 0; y < rowCount; y--) {
 		const rowCells: CellState[] = [];
 

[Survived] EqualityOperator
src/modules/Game/gameReducer.ts:23:20
 
 			if (Math.round(Math.random() * 100) <= fillingPercent) {
 				aliveCount++;
-				if (aliveCount <= maxAliveCount) {
+				if (aliveCount < maxAliveCount) {
 					cellState = CellState.alive;
 				}

[Survived] ConditionalExpression
src/modules/Game/gameReducer.ts:130:8
 			state.currentHistoryStep++;
 		},
 		nextStep(state) {
-			if (!state.isPlaying && state.currentHistoryStep < state.history.length - 1) {
+			if (true) {
 
 				state.currentHistoryStep++;

[Survived] EqualityOperator
src/modules/Game/gameReducer.ts:137:53
 			}
 		},
 		prevStep(state) {
-			if (!state.isPlaying && state.currentHistoryStep > 0) {
+			if (!state.isPlaying && state.currentHistoryStep >= 0) {
 
 				state.currentHistoryStep--;

[Survived] ObjectLiteral
src/modules/Game/gameReducer.ts:160:30
 } = gameSlice.actions;
 export const gameReducer = gameSlice.reducer;
 
-export const gameSelectors = {
-	settings: ({ game }: AppState) => game.settings,
-	field: ({ game }: AppState) => game.field,
-	gameIsPlaying: ({ game }: AppState) => game.isPlaying,
-	hasPrevStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep > 0,
-	hasNextStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep < game.history.length - 1,
-};
+export const gameSelectors = {};
 
 const getNextCellState = (oldCell: CellState, neighbours: CellState[]): CellState => {

[Survived] ConditionalExpression
src/modules/Game/gameReducer.ts:164:58
 	settings: ({ game }: AppState) => game.settings,
 	field: ({ game }: AppState) => game.field,
 	gameIsPlaying: ({ game }: AppState) => game.isPlaying,
-	hasPrevStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep > 0,
+	hasPrevStep: ({ game }: AppState) => !game.isPlaying && true,
 	hasNextStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep < game.history.length - 1,
 };

[Survived] ArithmeticOperator
src/modules/Game/gameReducer.ts:165:104
 	field: ({ game }: AppState) => game.field,
 	gameIsPlaying: ({ game }: AppState) => game.isPlaying,
 	hasPrevStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep > 0,
-	hasNextStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep < game.history.length - 1,
+	hasNextStep: ({ game }: AppState) => !game.isPlaying && game.currentHistoryStep < game.history.length + 1,
 };
 

[Survived] ConditionalExpression
src/modules/Game/gameReducer.ts:174:33
 	).length;
 
 	if ((oldCell === CellState.alive &&
-		(aliveNeighbourCount === 2 || aliveNeighbourCount === 3)) ||
+		(aliveNeighbourCount === 2 || false)) ||
 		(oldCell === CellState.dead && aliveNeighbourCount === 3)
 	) {

[Survived] ConditionalExpression
src/modules/Game/gameReducer.ts:209:7
 		const getCellIndex = (index: number) =>
 			index < 0
 				? 0
-				: index > settings.columnCount
+				: false
 					? settings.columnCount
 					: index;

[Survived] EqualityOperator
src/modules/Game/gameReducer.ts:209:13
 		const getCellIndex = (index: number) =>
 			index < 0
 				? 0
-				: index > settings.columnCount
+				: index >= settings.columnCount
 					? settings.columnCount
 					: index;
