[Survived] BlockStatement
Otus_react/otus_react_game_of_life/src/store.ts:27:37
 
 export const restore = createAction("restore");
 export const rootReducer = (state: any, action: any) => {
-  if (action.type === restore.type) {
-    state = { ...initialAppState };
-  }
+  if (action.type === restore.type) {}
 
   return reducer(state, action);

[Survived] ConditionalExpression
Otus_react/otus_react_game_of_life/src/store.ts:27:7
 
 export const restore = createAction("restore");
 export const rootReducer = (state: any, action: any) => {
-  if (action.type === restore.type) {
+  if (false) {
     state = { ...initialAppState };
   }

[Survived] ArrayDeclaration
Otus_react/otus_react_game_of_life/src/store.ts:41:15
 
 export const store = configureStore({
   reducer: rootReducer,
-  middleware: [sagaMiddleware],
+  middleware: [],
 });
 
